docs/acl/acl-bench-results/raw/S01/getset_m2.txt
ERROR: ERR admin permission required to perform the command
ERROR: failed to fetch CONFIG from 127.0.0.1:7772
WARN: could not fetch server CONFIG
====== SET ======
  20000 requests completed in 2.82 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.00% <= 0.5 milliseconds
0.01% <= 0.8 milliseconds
0.02% <= 0.9 milliseconds
0.03% <= 1.0 milliseconds
0.04% <= 1.1 milliseconds
0.10% <= 1.2 milliseconds
0.16% <= 1.3 milliseconds
0.25% <= 1.4 milliseconds
0.38% <= 1.5 milliseconds
0.52% <= 1.6 milliseconds
0.75% <= 1.7 milliseconds
0.98% <= 1.8 milliseconds
1.38% <= 1.9 milliseconds
1.85% <= 2 milliseconds
7.58% <= 3 milliseconds
15.03% <= 4 milliseconds
25.69% <= 5 milliseconds
40.58% <= 6 milliseconds
57.72% <= 7 milliseconds
72.94% <= 8 milliseconds
83.46% <= 9 milliseconds
90.16% <= 10 milliseconds
94.62% <= 11 milliseconds
97.14% <= 12 milliseconds
98.30% <= 13 milliseconds
99.08% <= 14 milliseconds
99.38% <= 15 milliseconds
99.58% <= 16 milliseconds
99.81% <= 17 milliseconds
99.88% <= 18 milliseconds
99.89% <= 19 milliseconds
99.90% <= 20 milliseconds
99.93% <= 21 milliseconds
99.96% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 28 milliseconds
7099.75 requests per second

====== GET ======
  20000 requests completed in 1.86 seconds
  50 parallel clients
  64 bytes payload
  keep alive: 1
  multi-thread: no

0.32% <= 1 milliseconds
25.55% <= 2 milliseconds
58.81% <= 3 milliseconds
74.75% <= 4 milliseconds
82.82% <= 5 milliseconds
87.07% <= 6 milliseconds
89.36% <= 7 milliseconds
91.07% <= 8 milliseconds
92.69% <= 9 milliseconds
94.01% <= 10 milliseconds
94.99% <= 11 milliseconds
96.11% <= 12 milliseconds
96.83% <= 13 milliseconds
97.39% <= 14 milliseconds
97.97% <= 15 milliseconds
98.32% <= 16 milliseconds
98.49% <= 17 milliseconds
98.77% <= 18 milliseconds
98.97% <= 19 milliseconds
99.14% <= 20 milliseconds
99.28% <= 21 milliseconds
99.44% <= 22 milliseconds
99.58% <= 23 milliseconds
99.64% <= 24 milliseconds
99.68% <= 25 milliseconds
99.78% <= 26 milliseconds
99.84% <= 27 milliseconds
99.96% <= 28 milliseconds
99.97% <= 29 milliseconds
99.99% <= 30 milliseconds
100.00% <= 35 milliseconds
100.00% <= 36 milliseconds
10764.26 requests per second